export const articles = [
    {
        id: 1,
        title: "Что такое блокчейн?",
        description: "Узнайте, как работает блокчейн — революционная технология, лежащая в основе биткоина и криптовалют. Простое объяснение сложных вещей: от принципов децентрализации до реальных примеров использования.",
        slug: "chto-takoe-blokchejn",
        path: "/blog/chto-takoe-blokchejn.html",
        image: "/images/btc-default.png",
        tags: ["Bitcoin", "Обмен", "Blockchain"],
        toc: [
            { id: "основы-блокчейн-технологии", title: "Основы блокчейн технологии" },
            { id: "принцип-работы-и-структура-блоков", title: "Принцип работы и структура блоков" },
            { id: "безопасность-и-децентрализация", title: "Безопасность и децентрализация" },
            { id: "применение-в-финансовой-сфере", title: "Применение в финансовой сфере" },
            { id: "применение-блокчейна-в-различных-отраслях", title: "Применение блокчейна в различных отраслях" },
            { id: "перспективы-развития-и-вызовы-технологии", title: "Перспективы развития и вызовы технологии" }
        ]
    },

];