export interface Review {
    id: number;
    author: string;
    rating: number;
    text: string;
}

export const reviews: Review[] = [
    {
        id: 1,
        author: "Vladislav",
        rating: 5,
        text: "лучший обменник, работаем уже несколько лет, 237 успешных сделок🤝",
    },
    {
        id: 2,
        author: "Добрый День",
        rating: 4,
        text: "Всей команде респект и уважуха, уже 7 обменов здесь и все всегда четенько, вы лучшие!",
    },
    {
        id: 3,
        author: "Дмитрий",
        rating: 5,
        text: "На самом деле, решил тоже высказаться, 3 обмена, всегда все четко...",
    },
    {
        id: 4,
        author: "phantom",
        rating: 4,
        text: "Совершил 2 обмена, все четко и быстро! 10-15 мин на всё-провсё...",
    },
    {
        id: 5,
        author: "Garry Potter",
        rating: 5,
        text: "Самый лучший обменник на свете, приятный курс, приходят быстро 👍",
    },
    {
        id: 6,
        author: "Rafaelka",
        rating: 4,
        text: "😻🖤 самый лучший обменник",
    },
    {
        id: 7,
        author: "Mikosss",
        rating: 5,
        text: "Отличный обменник, честный, порядочный и отзывчивый ❤️",
    },
    {
        id: 8,
        author: "morozzz",
        rating: 4,
        text: "Отличный обменник, всегда обмен быстро происходит, чётко...",
    },
    {
        id: 9,
        author: "X3pypr FantasticDay☀️",
        rating: 5,
        text: "Утро, воскресенье, обмен за 5 минут прошёл, лучший обменник ❤️",
    },
    {
        id: 10,
        author: "X3pypr FantasticDay☀️",
        rating: 5,
        text: "Утро, воскресенье, обмен за 5 минут прошёл, лучший обменник ❤️",
    },
    {
        id: 11,
        author: "Hanna Montana",
        rating: 5,
        text: "самый быстрый самый лучший самый четкий, и оператор красавчееееегг))) 🔥🔥🔥",
    },
    {
        id: 12,
        author: "𝒦𝑜𝓀𝑜𝓈 𝓋 𝓃𝑜𝓈",
        rating: 5,
        text: "самые лучшие ❤️ ван лав",
    },
    {
        id: 13,
        author: "Наташка😜",
        rating: 5,
        text: "лучший обменник, не большая комиссия, быстрые обмены, всегда все без проблем! Поддержка быстро отвечает и помогает в любых ситуациях❤️ спасибо обменнику и сотрудникам за их работу😘",
    },
    {
        id: 14,
        author: "Наталья",
        rating: 5,
        text: "лучшие!!! Спасибо уже всё на балансе",
    },
    {
        id: 15,
        author: "Мартин Лютер Кинг",
        rating: 5,
        text: "Лучший обменник на планете Земля!!! На луне например, обмен 2 года длится, а тут всего 10-20 минут. За что вселенская благодарность и внеземные почести!)",
    },
    {
        id: 16,
        author: "Ve 🐽",
        rating: 5,
        text: "Очень хороший обменник, без каких либо скрытых подвохов как это бывают у других, тех поддержка отвечает очень быстро и помогают решить любой вопрос в кратчайшие сроки. С обменником знаком уже 3 года, и не перестают меня удивлять, Всем спасибо за такую хорошую работу и отклик к клиенту.",
    },
    {
        id: 17,
        author: "oioioi",
        rating: 5,
        text: "обмен произведен быстро, четкий сервис !",
    },
    {
        id: 18,
        author: "🤍",
        rating: 5,
        text: "спустя 180 обменов ,могу точно сказать ,что обменник топ.Все быстро,качественно,на вопросы всегда ответят,сама несколько раз косячила ,но все быстро решалось.Спасибо)",
    },
    {
        id: 19,
        author: "phantom",
        rating: 5,
        text: "Все обмены всегда были сделаны, это просто топ, спасибо ребята!)",
    },
    {
        id: 20,
        author: "ТАЙФУН",
        rating: 5,
        text: "Лучший сервис обменник в считанные минуты , очень радует комиссия и сам сервис просто топ номер 1",
    },
    {
        id: 21,
        author: "Роман",
        rating: 5,
        text: "Лучшие !лучше вас не встречал . Комиссии человеческие !третий обмен у вас только.теперь только с вами !спасибо !",
    }
];
