export const faqData = [
    {
        id: 'q1',
        question: 'Как обменять биткоины на рубли?',
        answer: 'Вы можете обменять биткоины на рубли через наш телеграм-бот, который предлагает выгодные курсы и минимальные комиссии.',
        link: {
            text: 'Инструкция',
            url: '/obmen-bitcoin'
        }
    },
    {
        id: 'q2',
        question: 'Какие валюты поддерживаются?',
        answer: 'Мы поддерживаем следующие валюты: BTC, LTC, USDT, XMR, RUB. Вы можете выбрать удобную для вас валюту для обмена.'
    },
    {
        id: 'q3',
        question: 'Как долго занимает обработка обмена?',
        answer: 'Обычно обработка обмена занимает от 5 до 30 минут в зависимости от загруженности сети и выбранного способа оплаты.'
    },
    {
        id: 'q4',
        question: 'Есть ли у вас поддержка клиентов?',
        answer: 'Да, наша служба поддержки доступна ежедневно с 8:00 до 23:00 и готова помочь вам с любыми вопросами по обмену валют.',
        link: {
            text: 'Поддержка',
            url: 'https://t.me/Btcbank24com_bot'
        }
    },
    {
        id: 'q5',
        question: 'Какие комиссии взимаются при обмене?',
        answer: 'Размер комиссии зависит от направления и суммы обмена. Чем больше сумма, тем ниже комиссия. Наши условия прозрачны и указаны на сайте при оформлении обмена. Мы рекомендуем создать обмен в нужном направлении — бот автоматически рассчитает курс и комиссию по вашей заявке, предоставив лучшие условия для обмена.'
    },
    {
        id: 'q6',
        question: 'Как долго проверяется платеж на карту?',
        answer: 'Для обработки платежей наш обменник использует сторонний платежный сервис. Время проверки может занять до 30 минут. В случае отклонения платежа мы можем запросить у вас банковскую выписку или видеозапись, демонстрирующую процесс входа в мобильный банк и открытие чека платежа.'
    },
    {
        id: 'q7',
        question: 'Почему нет свободных реквизитов?',
        answer: 'Высокий спрос на реквизиты может приводить к их временному отсутствию. Как только появляются новые реквизиты, они становятся доступными для оплаты. Мы рекомендуем периодически проверять их наличие (повторно создавать обмен рекомендуем способ СБП), чтобы успеть воспользоваться предложением.'
    }
];